[
  {
    "title": "Denver Breweries – Colorado Brewery List",
    "url": "https://www.coloradobrewerylist.com/brewery_city/denver/",
    "content": "View the list of breweries in Denver, CO. See currently operating breweries as well as locations slated for future opening.",
    "engine": "startpage",
    "score": 2.6666666666666665
  },
  {
    "title": "Denver Beer Trail | Denver Breweries by Neighborhood",
    "url": "https://visitdenver.com/food-drink/breweries/",
    "content": "No flair, no twist, just clean lager beer. ... Black Shirt is a small but mighty independent craft brewery, artisan pizza kitchen and live music venue located in the northern reaches of RiNo.",
    "engine": "startpage",
    "score": 2.6666666666666665
  },
  {
    "title": "The 21 Best Breweries in Denver, Colorado - Hop Culture",
    "url": "https://www.hopculture.com/best-breweries-denver-colorado/",
    "content": "Every year, the Great American Beer Festival (GABF) descends in Denver, CO. We just went a couple of weeks ago, attending the GABF Awards Ceremony, which awarded 326 Medals to 273 breweries and cideries with the top beers and ciders of the year in 102 categories. We also had a chance to get around to some of our favorite breweries and a few we'd never had a chance to visit. Overall, craft ...",
    "engine": "startpage",
    "score": 1.9912280701754386
  },
  {
    "title": "TOP 10 BEST Craft Beer Breweries in Denver, CO - Yelp",
    "url": "https://www.yelp.com/search?find_desc=craft+beer+breweries&find_loc=Denver%2C+CO",
    "content": "Top 10 Best Craft Beer Breweries in Denver, CO - Last Updated September 2025 - Yelp - Westbound & Down - Denver, Crazy Mountain Brewery, Cerebral Brewing, Black Shirt Brewing, Zuni Street Brewing, Odell Brewing Co - Five Points Brewhouse, Copper Kettle Brewing, Our Mutual Friend Brewing Company, Danico Brewing Company",
    "engine": "duckduckgo",
    "score": 1.0
  },
  {
    "title": "Great Divide Brewing Co. - Great Minds Drink Alike - Denver, CO",
    "url": "https://greatdivide.com/",
    "content": "Founded in 1994, Great Divide Brewing Company is Denver’s oldest and largest packaging brewery and one of the most decorated breweries in America. ‘Bold Character’ isn’t just a catchphrase. It’s the philosophy behind what we brew, how we think, and what we believe.",
    "engine": "startpage",
    "score": 0.7222222222222222
  },
  {
    "title": "Best Breweries in Denver: Where to Drink Craft Beer in Denver - Thrillist",
    "url": "https://www.thrillist.com/drink/denver/best-denver-breweries",
    "content": "The greatest part about Denver’s collective love of beer—aside from the fact that it promotes such community and camaraderie—is that the brewers and beer-slingers here all have their own unique twist to offer. You can take a seat at a spot in LoHi that specializes in German-style brews or get your ultimate sour fix just beyond Sloan’s Lake. The spectrum of beers available is vast, and the folks behind the magic stay plugging away at their craft each and every day so that Denverites may cheers and rejoice with their IPAs, amber ales, porters, and stouts.",
    "engine": "duckduckgo",
    "score": 0.6000000000000001
  },
  {
    "title": "10 Of The Best Breweries In Denver That Are Hoppin' Fantastic",
    "url": "https://secretdenver.com/best-breweries-denver/",
    "content": "Louis Hansel via Unsplash Did you know that Denver boasts one of the highest concentrations of craft breweries in the United States? With over 150 breweries nestled in the Mile High City, Denver has become a safe haven for beer enthusiasts seeking unique and diverse flavors. From hop-forward IPAs to smooth and rich stouts, Denver's booming brewery scene offers something for everyone.",
    "engine": "duckduckgo",
    "score": 0.5
  },
  {
    "title": "Monolith Brewing | Craft Brewery in Denver | 1290 South Broadway, Denver, CO 80210, USA",
    "url": "https://www.monolithbrewing.com/",
    "content": "Monolith Brewing is a Craft Brewery in Denver, Colorado. You can come and enjoy beer, live music and entertainment.",
    "engine": "brave",
    "score": 0.5
  },
  {
    "title": "A Beer Lover's Guide to Denver - A Blonde with a Brew",
    "url": "https://www.ablondewithabrew.com/post/a-beer-lover-s-guide-to-denver",
    "content": "Despite being 35 years in business, Odell maintains its status as an independently owned craft brewery. It's RiNo location has an excellent outdoor space with fire pits, as well as a ten barrel pilot system producing beers exclusive to this taproom. Great Divide Brewing - Another Denver classic dating back to 1994, Great Divide will always hold a special place in my heart, as I mentioned in the beginning of this article, for being the brewery that ignited my love for craft beer with it's flagship saison Colette.",
    "engine": "startpage",
    "score": 0.4509803921568627
  },
  {
    "title": "Wynkoop",
    "url": "https://wynkoop.com/",
    "content": "You can explore and taste the best breweries in Denver, the capital city of Colorado, thanks to its fantastic craft brewery culture and location at the heart of the famous Denver Beer Triangle.",
    "engine": "startpage",
    "score": 0.3666666666666667
  }
]