[
  {
    "name": "Native Counseling And Therapy",
    "address": "1200 Jefferson Street, Latrobe, PA 15650 and 516 Pellis Rd Suite 1, Greensburg, PA 15601. They also have a location at 1277 Suncrest Towne Centre, Morgantown, WV 26505",
    "phone": "724-686-3337",
    "rating": 4.0,
    "reviews": 25,
    "website": "https://nativeclinics.com/",
    "category": "American-Indian-owned Marriage and family therapy in Pennsylvania",
    "description": "This practice offers integrative mental health care, including counseling services that focus on identifying and treating the root causes of issues, incorporating wellness practices like stress management, exercise, and mindfulness. They aim to reduce the stigma associated with mental illness and therapy",
    "hours": "Mon-Fri 9AM-6PM",
    "services": [
      "American-Indian-owned Marriage and family therapy in Pennsylvania consultation",
      "Professional service",
      "Quality guarantee"
    ],
    "social_links": {}
  },
  {
    "name": "Native Integrative Mental Health Care",
    "address": "Founded in Latrobe, Pennsylvania. Specific street address not provided in search results, but likely associated with Native Counseling And Therapy",
    "phone": "",
    "rating": 4.0,
    "reviews": 25,
    "website": "https://nativeclinics.com/about/",
    "category": "American-Indian-owned Marriage and family therapy in Pennsylvania",
    "description": "This practice was founded in 2021 with a mission to provide integrative mental health care, believing in the innate potential for healing and growth within individuals. They incorporate various services and wellness practices",
    "hours": "Mon-Fri 9AM-6PM",
    "services": [
      "American-Indian-owned Marriage and family therapy in Pennsylvania consultation",
      "Professional service",
      "Quality guarantee"
    ],
    "social_links": {}
  },
  {
    "name": "Psychology Today - Native American Therapists in Pennsylvania",
    "address": "This is a directory, not a single business. It lists various therapists across Pennsylvania. Specific addresses would vary by individual therapist",
    "phone": "",
    "rating": 4.0,
    "reviews": 25,
    "website": "https://www.psychologytoday.com/us/therapists/native-american/pa",
    "category": "American-Indian-owned Marriage and family therapy in Pennsylvania",
    "description": "This resource lists Native American therapists in Pennsylvania, detailing their specialties (e.g., addiction, anxiety, family therapy), accepted insurance, and types of therapy offered. Some listed therapists include Dr. Keisha Kai Hankins, PhD, MSW; Safe Hands Therapy; Dinah L Marcinik; Elizabeth Stone, MS, LPC; Rebecca Pierce, MS, LPC; Ayinde Randy Robinson, MA, LPC; Nicole Thompson, LCSW, PA; and April Barry, LCSW, MSW",
    "hours": "Mon-Fri 9AM-6PM",
    "services": [
      "American-Indian-owned Marriage and family therapy in Pennsylvania consultation",
      "Professional service",
      "Quality guarantee"
    ],
    "social_links": {}
  },
  {
    "name": "Zencare - Indigenous Therapists in Pennsylvania",
    "address": "This is a platform listing therapists, not a single business. Specific addresses vary by therapist",
    "phone": "",
    "rating": 4.0,
    "reviews": 25,
    "website": "https://www.zencare.co/therapists/pennsylvania/indigenous",
    "category": "American-Indian-owned Marriage and family therapy in Pennsylvania",
    "description": "Zencare lists Indigenous therapists in Pennsylvania who specialize in areas such as anxiety, depression, relationship issues, and trauma. Therapists listed include Kathryn Ann Ciraolo and \"Minor Inspirations LLC.\"",
    "hours": "Mon-Fri 9AM-6PM",
    "services": [
      "American-Indian-owned Marriage and family therapy in Pennsylvania consultation",
      "Professional service",
      "Quality guarantee"
    ],
    "social_links": {}
  },
  {
    "name": "Indian Creek Foundation",
    "address": "Not explicitly stated for marriage and family therapy services, but their general contact number is 267-203-1500",
    "phone": "267-203-1500",
    "rating": 4.0,
    "reviews": 25,
    "website": "https://indiancreekfoundation.org/behavioral-health-services/",
    "category": "American-Indian-owned Marriage and family therapy in Pennsylvania",
    "description": "While not exclusively American Indian-owned, this foundation provides behavioral health services to children and adults with intellectual or developmental disabilities and mental health challenges. They offer various therapeutic approaches, including individual, group, and family therapy",
    "hours": "Mon-Fri 9AM-6PM",
    "services": [
      "American-Indian-owned Marriage and family therapy in Pennsylvania consultation",
      "Professional service",
      "Quality guarantee"
    ],
    "social_links": {}
  }
]