[
  {
    "title": "Where To Yoga in Austin - Do512",
    "url": "https://do512.com/p/where-to-yoga-in-austin",
    "content": "Photo Credit: WANDERLUST FACEBOOK YTX Austin (formerly Wanderlust) 206 E 4th St YTX wants to make your time there doing yoga an escape, which is why they focus on quality instructors and amenities as well as an in-studio cafe and mat valet services. With retreats, workshops, teacher training, and classes, YTX Yoga (FKA Wanderlust) is the perfect place to fulfill all of your yogi dreams.",
    "engine": "startpage",
    "score": 4.75
  },
  {
    "title": "The Absolute Best Yoga Studios in Austin [Updated 2025]",
    "url": "https://austinstaysweird.com/best-yoga-studios-in-austin",
    "content": "With my yoga mat ever ready and a lighthearted mindset, I set out on a mission to review a whopping total of eight yoga studios in the vibrant city of Austin. From serene spaces tucked away in cozy neighborhoods to trendy studios downtown, each one had its unique charm.",
    "engine": "startpage",
    "score": 4.3
  },
  {
    "title": "TOP 10 BEST Yoga Studios in Austin, TX - Updated 2025 - Yelp",
    "url": "https://www.yelp.com/search?find_desc=Yoga+Studios&find_loc=Austin%2C+TX",
    "content": "What are people saying about yoga in Austin, TX? This is a review for yoga in Austin, TX: \"Great space for an afternoon yoga! My friend invited me to practice for the first time. Bring 5 months pregnant, this was much needed. The space is large with a bathroom in the back. There are cubbies for your stuff, blocks and blankets to use. The environment is calming and smells nice. The instructor ...",
    "engine": "brave",
    "score": 2.0
  },
  {
    "title": "Black Swan Yoga | Home Page",
    "url": "https://www.blackswanyoga.com/",
    "content": "Annual Auto-draft (select cities) join now · big ass sale pricing · Get access to more than 500 videos from BSY teachers and do yoga on whatever device you'd like, anytime! join now · BLACK SWAN YOGA is a community-driven, donation-based, heated yoga studio.",
    "engine": "startpage",
    "score": 1.25
  },
  {
    "title": "YTX Yoga: Yoga Classes, Retreats, & Teacher Trainings",
    "url": "https://ytxaustin.com/",
    "content": "Our in-studio public and private classes are led by the most experienced instructors in Austin, including Mat Pilates, Vinyasa, Power Vinyasa, Yin & Stretch, YoStrong (Yoga infused HIIT with weights), and THAW (Yoga infused ...",
    "engine": "startpage",
    "score": 1.1666666666666665
  },
  {
    "title": "7 Yoga Studios in Austin to Try | Visit Austin, TX",
    "url": "https://www.austintexas.org/austin-insider-blog/post/5-visitor-friendly-austin-yoga-studios/",
    "content": "Austin's yoga and fitness community is easily navigable and super visitor-friendly. Here are 7 yoga studios in Austin, Texas to try out during your next visit. Whether you're looking for hot yoga in Austin, Ashtanga yoga in Austin, live music yoga or beginner classes and yoga or meditation workshops in Austin, we have a studio for you.",
    "engine": "duckduckgo",
    "score": 1.0
  },
  {
    "title": "yoga studio recs? : r/Austin - Reddit",
    "url": "https://www.reddit.com/r/Austin/comments/12m0zvk/yoga_studio_recs/",
    "content": "Apr 14, 2023 ... Practice Yoga is a donation based studio in East Austin. They're very down to earth, approachable for all levels, and have a variety of classes.",
    "engine": "startpage",
    "score": 0.8
  },
  {
    "title": "Downtown Austin Yoga Studio | PURE Yoga Texas",
    "url": "https://www.pureyogatexas.com/downtown-austin",
    "content": "Our Downtown Austin yoga studio is an urban oasis in the Clarksville area of Austin, close to shops and restaurants that make Austin one of the most unique cities in the United States.",
    "engine": "startpage",
    "score": 0.7222222222222222
  },
  {
    "title": "Austin's Best Yoga Studio | Donation Based Yoga",
    "url": "https://www.myvinyasapractice.com/",
    "content": "The best yoga studio in Austin, My Vinyasa Practice offers daily vinyasa classes both online and in person to meet yogis safely on the mat.",
    "engine": "startpage",
    "score": 0.5833333333333333
  },
  {
    "title": "Practice Yoga Austin | Absurdly High Quality Donation Yoga",
    "url": "https://practiceyogaaustin.com/",
    "content": "Absurdly high-quality, donation-based yoga since 2013 on the East Side of Austin :: Join us for a class 1103 E. 6th Street, 78702.",
    "engine": "startpage",
    "score": 0.5151515151515151
  }
]