[
  {
    "title": "Exploring Seattle's Best Third-Wave Coffee Shops - Feastio",
    "url": "https://feastio.com/coffee-shops-seattle/",
    "content": "Known for prioritizing relationships between baristas and customers, roasters and growers, Herkimer Coffee maintains a boutique size with multiple locations across Phinney Ridge, Ravenna, and downtown Seattle.",
    "engine": "startpage",
    "score": 4.0
  },
  {
    "title": "10 Amazing Cafes to Grab a Coffee in Seattle (That Aren't Starbucks)",
    "url": "https://explorewashingtonstate.com/10-cafes-to-grab-a-coffee-in-seattle/",
    "content": "Cafeé Vita has become one of my favorite local spots in my neighborhood and is an excellent place to experience and embrace the coffee culture of Seattle. ... Victrola is one of the most popular independent coffee shops in Seattle and roasts ...",
    "engine": "startpage",
    "score": 2.0
  },
  {
    "title": "Where to Find Seattle's Best Coffee | Eater Seattle",
    "url": "https://seattle.eater.com/maps/seattles-best-coffee-shops",
    "content": "A while back we were chatting with someone in the coffee world who told us how dumb and bad this map is. You can't really make a single list of Seattle's best or most important coffee shops because \"coffee shop\" can mean so many different things. Do you want someplace to chill on a laptop? Dark roast or light roast? Do you like your cafes to be well-lit gathering spaces a la the Vita ...",
    "engine": "duckduckgo",
    "score": 1.5285714285714285
  },
  {
    "title": "r/espresso on Reddit: Traveling to Seattle… coffee shop recommendations?",
    "url": "https://www.reddit.com/r/espresso/comments/1byfxkq/traveling_to_seattle_coffee_shop_recommendations/",
    "content": "Apr 7, 2024 ... If you like dark, dark, dark roasts, hit up Cafe Umbria. Better yet, hit up Macrina Bakery, which has excellent fresh pastries in addition to ...",
    "engine": "startpage",
    "score": 1.1666666666666665
  },
  {
    "title": "Double Skinny Macchiato - Bex's Coffee Travels: 13 Specialty Coffee Shops To Visit in Seattle",
    "url": "https://www.doubleskinnymacchiato.com/2020/03/seattle-specialty-coffee-shops-guide-map.html",
    "content": "Elm Coffee Roasters (South Lake Union and Pioneer Square) I was able to visit both of Elm Coffee Roasters' Seattle cafes, starting with the location on Ninth Avenue North, a few blocks south of Lake Union.",
    "engine": "startpage",
    "score": 1.1666666666666665
  },
  {
    "title": "Seattle's Best Coffee Shops [Updated 2025]",
    "url": "https://seattlesecrets.org/best-coffee-shops-in-seattle",
    "content": "If you're in Seattle and craving a truly unparalleled caffeine journey, Ghost Note Coffee is a stop you won't want to skip. It's not just coffee; it's an experience that teases your taste buds and warms your heart, leaving you pleasantly enchanted long after your visit! You might also want to check out the best coffee shops in Tacoma.",
    "engine": "duckduckgo",
    "score": 1.0
  },
  {
    "title": "The 20 Best Coffee Shops In Seattle - Seattle - The Infatuation",
    "url": "https://www.theinfatuation.com/seattle/guides/best-coffee-shops-seattle",
    "content": "3 weeks ago - On a hot day, you can also find Boon Boona’s coffee steeped into popsicles at Seattle Pops. ... Monorail Espresso has been a classic since 1980, and this little walk-up window should be on your shortlist of Downtown coffee shops that make it worth spending time Downtown.",
    "engine": "duckduckgo",
    "score": 0.8666666666666667
  },
  {
    "title": "The Best Coffee In Seattle: 15 Great Seattle Coffee Shops",
    "url": "https://wheatlesswanderlust.com/best-coffee-shops-in-seattle/",
    "content": "Coffee Loyalists: These shops don’t roast their own beans, but exclusively use beans from one specific roaster. After touring Seattle coffee shops, I saw a lot of Counter Culture, Olympia, and Heart (one of the best coffee roasters in Portland).",
    "engine": "startpage",
    "score": 0.5833333333333333
  },
  {
    "title": "10 Most Instagrammable Coffee Shops in Seattle - Emma's Edition -",
    "url": "https://www.emmasedition.com/2019/08/most-instagrammable-coffee-shops-in-seattle.html",
    "content": "Callus is right across the street from General Porpoise in Pioneer Square. I first featured Callus in Seattle’s Most Instagrammable Places in Pioneer Square. I love how this coffee shop is in the middle of a handful of small boutiques.",
    "engine": "startpage",
    "score": 0.5333333333333333
  },
  {
    "title": "TOP 10 BEST Coffee & Cafes in Seattle, WA - Updated 2025 - Yelp",
    "url": "https://www.yelp.com/search?find_desc=Coffee+%26+Cafes&find_loc=Seattle%2C+WA",
    "content": "What are people saying about coffee roasteries in Seattle, WA? This is a review for coffee roasteries in Seattle, WA: \"Stopped in for a quick coffee and pastry while staying in the area. The latte was very well made and the cinnamon roll was flaky, not too sweet, and had a nice tangy (sour cream?) icing. Atmosphere was relaxed with an undercurrent of office workers escaping their cubicles ...",
    "engine": "duckduckgo",
    "score": 0.5
  }
]