[
  {
    "title": "THE 15 BEST Santa Fe Art Galleries (2025) - Tripadvisor",
    "url": "https://www.tripadvisor.com/Attractions-g60958-Activities-c49-t1-Santa_Fe_New_Mexico.html",
    "content": "Mountain Trails includes some of the best artists in both New Mexico and Arizona and beyond. The paintings of Dave Santillanes are a must have. Vic Payne's sculptures are truly amazing.",
    "engine": "startpage",
    "score": 7.5
  },
  {
    "title": "TOURISM Santa Fe: Visiting Santa Fe/Galleries and Studios",
    "url": "https://www.santafe.org/things-to-do/visual-arts/galleries-and-studios/",
    "content": "Galleries and Studios Santa Fe offers a visual feast for art lovers of all sorts, whether you're a serious collector or a fan who finds joy in just viewing the work. With more than 250 galleries to explore, you'll be astonished by the city's array of art, including traditional and contemporary painting, photography, pottery, sculpture, textiles and more. Get a chance to meet some of the ...",
    "engine": "startpage",
    "score": 5.5
  },
  {
    "title": "Galleries - Santa Fe - Canyon Road",
    "url": "https://www.visitcanyonroad.com/businesses/galleries/",
    "content": "Contemporary Art & Photography 729 Canyon Road Santa Fe, NM 87501 505 982-9668 · Follow a manual added link · 201 Canyon Road · Follow a manual added link · 702 1/2 Canyon Road · Follow a manual added link · 225 Canyon Road #6 · Follow a manual added link ·",
    "engine": "startpage",
    "score": 2.75
  },
  {
    "title": "Santa Fe Art Galleries and 2025 Santa Fe Gallery Guide",
    "url": "https://art-collecting.com/galleries_nm_santafe.htm",
    "content": "We are an online gallery offering a growing collection of fine art that has been carefully selected. All art work is presented with a letter of authenticity and artist bio. In addition to our collection some of the artists can offer commission work. \"art is gallery santa fe\" at 419 Canyon Road, ...",
    "engine": "duckduckgo",
    "score": 1.1666666666666667
  },
  {
    "title": "Wolfram|Alpha (Santa Fe | location)",
    "url": "https://www.wolframalpha.com/input/?i=art+galleries+in+santa+fe",
    "content": "Result: (data not available)",
    "engine": "wolframalpha",
    "score": 1.0
  },
  {
    "title": "Santa Fe Trails Fine Art",
    "url": "https://www.santafetrailsfineart.com/",
    "content": "Located in historic Santa Fe on Old Santa Fe Trail, our gallery is proud to represent and showcase over sixty-five nationally and internationally renowned artists of our time featuring a mixture of traditional, Native American, Western, and contemporary paintings, bronze and stone sculpture, and artifact reproductions.",
    "engine": "startpage",
    "score": 0.7
  },
  {
    "title": "Art Galleries | Santa Fe Galleries",
    "url": "https://www.santafegalleryassociation.org/member-galleries",
    "content": "Complete listing of all SFGA member galleries, museum and art businesses in Santa Fe, Santa Fe County and Northern New Mexico. Whether you're searching for a Contemporary oil on canvas, Southwestern fine art jewelry, a world class appraisal or massive bronze sculpture for your city's main street median, it's here.",
    "engine": "duckduckgo",
    "score": 0.6222222222222222
  },
  {
    "title": "LewAllen Galleries | Santa Fe, NM | Home",
    "url": "https://lewallengalleries.com/",
    "content": "LewAllen Galleries has been a pioneering force for contemporary and modern art for more than 47 years, maintaining a robust schedule of exciting exhibitions, ...",
    "engine": "startpage",
    "score": 0.6190476190476191
  },
  {
    "title": "InArt Santa Fe",
    "url": "https://inartsantafe.com/",
    "content": "A boutique gallery in the heart of Santa Fe. Our collection is wonderfully eclectic, and our team is unpretentious and friendly. We carry everything from fine jewelry and sculpture to oil painting and encaustic designs. Discover something extraordinary.",
    "engine": "startpage",
    "score": 0.6000000000000001
  },
  {
    "title": "Art Galleries - Santa Fe Selection Travel Guide",
    "url": "https://santafeselection.com/galleries/",
    "content": "Art Galleries...Santa Fe is the third-largest art market in the U.S, a veritable Mecca for enthusiasts and collectors of historic and contemporary art of New Mexico, Native American arts, and folk art from around the globe. Our curated selection of the top galleries gets your search off to the best start.",
    "engine": "duckduckgo",
    "score": 0.42857142857142855
  }
]